# Sakila Star Schema & ETL - Part 1

All the database tables in this notebook are based on public database samples and transformations.
- `Sakila` is a sample database created by *MySql*: [Link](https://dev.mysql.com/doc/sakila/en/).
- The *Postgres* version of it is called `Pagila`: [Link](https://github.com/devrimgunduz/pagila).

## NOTE: Use of ipython-sql package

- Load ipython-sql: `%load_ext sql`

- To execute SQL queries you write one of the following atop of your cell: 
    - `%sql`
        - For a one-liner SQL query.
        - You can access a python var using `$`.   
    - `%%sql`
        - For a multi-line SQL query.
        - You can **NOT** access a python var using `$`.


- Running a connection string like:
`postgresql://username:password@host:port/database` connects to the database.

_______________________
_______________________

## STEP 1. Connect to the local database where Pagila is loaded

In [1]:
!psql --version

psql (PostgreSQL) 12.12 (Ubuntu 12.12-0ubuntu0.20.04.1)

No need to run the cell below if `pagila_db` has been already created and populated (via docker-compose and docker exec commands).

In [2]:
# !PGPASSWORD=root createdb -h localhost -U root pagila_db
# !PGPASSWORD=root psql -q -h localhost -U root -d pagila_db -f ../pagila_data/pagila-schema.sql
# !PGPASSWORD=root psql -q -h localhost -U root -d pagila_db -f ../pagila_data/pagila-data.sql

### Option 1: connect via ipython-sql

In [3]:
%load_ext sql

In [4]:
DB_ENDPOINT = "localhost"
DB_NAME = 'pagila_db'
DB_USER = 'root'
DB_PASSWORD = 'root'
DB_PORT = '5432'

# postgresql://username:password@host:port/database
conn_string = f"postgresql://{DB_USER}:{DB_PASSWORD}@{DB_ENDPOINT}:{DB_PORT}/{DB_NAME}"

print(conn_string)

postgresql://root:root@localhost:5432/pagila_db

In [5]:
%sql $conn_string

### Option 2: connect via psycopg2 package

In [6]:
import psycopg2
from prettytable import PrettyTable

In [7]:
try: 
    conn = psycopg2.connect("host=localhost dbname=pagila_db user=root password=root")
    conn.autocommit = True
except psycopg2.Error as e: 
    print("Error: Could not make connection to the Postgres database")
    print(e)
    
try: 
    cur = conn.cursor()
except psycopg2.Error as e: 
    print("Error: Could not get curser to the Database")
    print(e)

## STEP 2. Explore the 3NF Schema

<img src="../images/pagila-3nf.png" width=70%>

<img source="../images/pagila-3nf.png" width="50%">

### 2.1 How much? What data sizes are we looking at?

In [8]:
n_stores = %sql select count(*) from store;
n_films = %sql select count(*) from film;
n_customers = %sql select count(*) from customer;
n_rentals = %sql select count(*) from rental;
n_payments = %sql select count(*) from payment;
n_staff = %sql select count(*) from staff;
n_cities = %sql select count(*) from city;
n_countries = %sql select count(*) from country;

print("n_stores\t=", n_stores[0][0])
print("n_films\t\t=", n_films[0][0])
print("n_customers\t=", n_customers[0][0])
print("n_rentals\t=", n_rentals[0][0])
print("n_payments\t=", n_payments[0][0])
print("n_staff\t\t=", n_staff[0][0])
print("n_cities\t=", n_cities[0][0])
print("n_countries\t=", n_countries[0][0])

 * postgresql://root:***@localhost:5432/pagila_db
1 rows affected.
 * postgresql://root:***@localhost:5432/pagila_db
1 rows affected.
 * postgresql://root:***@localhost:5432/pagila_db
1 rows affected.
 * postgresql://root:***@localhost:5432/pagila_db
1 rows affected.
 * postgresql://root:***@localhost:5432/pagila_db
1 rows affected.
 * postgresql://root:***@localhost:5432/pagila_db
1 rows affected.
 * postgresql://root:***@localhost:5432/pagila_db
1 rows affected.
 * postgresql://root:***@localhost:5432/pagila_db
1 rows affected.
n_stores	= 2
n_films		= 1000
n_customers	= 599
n_rentals	= 16044
n_payments	= 16049
n_staff		= 2
n_cities	= 600
n_countries	= 109

### 2.2 When? What time period are we talking about?

In [9]:
%%sql
SELECT MIN(payment_date)::DATE AS start_date,
    MAX(payment_date)::DATE AS end_date
FROM payment;

 * postgresql://root:***@localhost:5432/pagila_db
1 rows affected.

[(datetime.date(2017, 1, 24), datetime.date(2017, 5, 14))]

### 2.3 Where? Where do events in this database occur?

Let's write a query that displays the number of addresses by district in the address table, and limit it to the top 10 districts.

In [10]:
%%sql
SELECT district,
    COUNT(district) AS n
FROM address
GROUP BY district
ORDER BY n DESC
LIMIT 10;

 * postgresql://root:***@localhost:5432/pagila_db
10 rows affected.

[('Buenos Aires', 10),
 ('Shandong', 9),
 ('California', 9),
 ('West Bengali', 9),
 ('Uttar Pradesh', 8),
 ('So Paulo', 8),
 ('England', 7),
 ('Maharashtra', 7),
 ('Southern Tagalog', 6),
 ('Gois', 5)]

## STEP 3. Perform some simple data analysis

### 3.1 Insight 1:   Top Grossing Movies 
- Payments amounts are in table `payment`
- Movies are in table `film`
- They are not directly linked, `payment` refers to a `rental`, `rental` refers to an `inventory` item and `inventory` item refers to a `film`
- `payment` &rarr; `rental` &rarr; `inventory` &rarr; `film`

In [11]:
%%sql
SELECT f.title, SUM(p.amount) AS total_amount
FROM film f, inventory i, rental r, payment p
WHERE f.film_id = i.film_id
    AND i.inventory_id = r.inventory_id
    AND r.rental_id = p.rental_id
GROUP BY f.title
ORDER BY total_amount DESC
LIMIT 10;

 * postgresql://root:***@localhost:5432/pagila_db
10 rows affected.

[('TELEGRAPH VOYAGE', Decimal('231.73')),
 ('WIFE TURN', Decimal('223.69')),
 ('ZORRO ARK', Decimal('214.69')),
 ('GOODFELLAS SALUTE', Decimal('209.69')),
 ('SATURDAY LAMBS', Decimal('204.72')),
 ('TITANS JERK', Decimal('201.71')),
 ('TORQUE BOUND', Decimal('198.72')),
 ('HARRY IDAHO', Decimal('195.70')),
 ('INNOCENT USUAL', Decimal('191.74')),
 ('HUSTLER PARTY', Decimal('190.78'))]

In [12]:
# psycopg2

query = """
SELECT f.title, SUM(p.amount) AS total_amount
FROM film f, inventory i, rental r, payment p
WHERE f.film_id = i.film_id
    AND i.inventory_id = r.inventory_id
    AND r.rental_id = p.rental_id
GROUP BY f.title
ORDER BY total_amount DESC
LIMIT 10;
"""

try:
    cur.execute(query)
except psycopg2.Error as e:
    print("Error while executing query")
    print(e)

table = PrettyTable()
table.field_names = ["title", "total_amount"]

row = cur.fetchone()
while row:
    table.add_row([row[0], row[1]])
    row = cur.fetchone()
print(table)

+-------------------+--------------+
|       title       | total_amount |
+-------------------+--------------+
|  TELEGRAPH VOYAGE |    231.73    |
|     WIFE TURN     |    223.69    |
|     ZORRO ARK     |    214.69    |
| GOODFELLAS SALUTE |    209.69    |
|   SATURDAY LAMBS  |    204.72    |
|    TITANS JERK    |    201.71    |
|    TORQUE BOUND   |    198.72    |
|    HARRY IDAHO    |    195.70    |
|   INNOCENT USUAL  |    191.74    |
|   HUSTLER PARTY   |    190.78    |
+-------------------+--------------+

### 3.2 Insight 2:   Top Grossing Cities 

`payment` &rarr; `customer` &rarr; `address` &rarr; `city`

In [13]:
%%sql
SELECT ci.city, SUM(p.amount) AS total_amount
FROM payment p, customer cu, address a, city ci
WHERE ci.city_id = a.city_id
    AND a.address_id = cu.address_id
    AND cu.customer_id = p.customer_id
GROUP BY ci.city
ORDER BY total_amount DESC
LIMIT 10;

 * postgresql://root:***@localhost:5432/pagila_db
10 rows affected.

[('Cape Coral', Decimal('221.55')),
 ('Saint-Denis', Decimal('216.54')),
 ('Aurora', Decimal('198.50')),
 ('Molodetno', Decimal('195.58')),
 ('Santa Brbara dOeste', Decimal('194.61')),
 ('Apeldoorn', Decimal('194.61')),
 ('Qomsheh', Decimal('186.62')),
 ('London', Decimal('180.52')),
 ('Ourense (Orense)', Decimal('177.60')),
 ('Bijapur', Decimal('175.61'))]

In [14]:
# psycopg2

query = """
SELECT ci.city, SUM(p.amount) AS total_amount
FROM payment p, customer cu, address a, city ci
WHERE ci.city_id = a.city_id
    AND a.address_id = cu.address_id
    AND cu.customer_id = p.customer_id
GROUP BY ci.city
ORDER BY total_amount DESC
LIMIT 10;
"""

try:
    cur.execute(query)
except psycopg2.Error as e:
    print("Error while executing query")
    print(e)

table = PrettyTable()
table.field_names = ["city", "total_amount"]

row = cur.fetchone()
while row:
    table.add_row([row[0], row[1]])
    row = cur.fetchone()
print(table)

+---------------------+--------------+
|         city        | total_amount |
+---------------------+--------------+
|      Cape Coral     |    221.55    |
|     Saint-Denis     |    216.54    |
|        Aurora       |    198.50    |
|      Molodetno      |    195.58    |
| Santa Brbara dOeste |    194.61    |
|      Apeldoorn      |    194.61    |
|       Qomsheh       |    186.62    |
|        London       |    180.52    |
|   Ourense (Orense)  |    177.60    |
|       Bijapur       |    175.61    |
+---------------------+--------------+

### 3.3 Insight 3 : Revenue of a movie by customer city and by month (data cube)

In [15]:
%%sql
SELECT f.title, ci.city, EXTRACT(month FROM p.payment_date) AS month, SUM(p.amount) AS revenue
FROM payment p, rental r, inventory i, film f, customer cu, address a, city ci
WHERE f.film_id = i.film_id
    AND i.inventory_id = r.inventory_id
    AND r.rental_id = p.rental_id
    AND p.customer_id = cu.customer_id
    AND cu.address_id = a.address_id
    AND a.city_id = ci.city_id
GROUP BY f.title, ci.city, month
ORDER BY month, revenue DESC
LIMIT 10;

 * postgresql://root:***@localhost:5432/pagila_db
10 rows affected.

[('SHOW LORD', 'Mannheim', 1.0, Decimal('11.99')),
 ('KISSING DOLLS', 'Toulon', 1.0, Decimal('10.99')),
 ('TELEGRAPH VOYAGE', 'Naala-Porto', 1.0, Decimal('10.99')),
 ('AMERICAN CIRCUS', 'Callao', 1.0, Decimal('10.99')),
 ('CASUALTIES ENCINO', 'Warren', 1.0, Decimal('10.99')),
 ('AUTUMN CROW', 'Ashgabat', 1.0, Decimal('9.99')),
 ('MIDSUMMER GROUNDHOG', 'Vaduz', 1.0, Decimal('9.99')),
 ('DAY UNFAITHFUL', 'Baybay', 1.0, Decimal('9.99')),
 ('CALIFORNIA BIRDS', 'Plock', 1.0, Decimal('9.99')),
 ('DARKO DORADO', 'Bhilwara', 1.0, Decimal('9.99'))]

## Close cursor and connection for psycopg2

In [16]:
cur.close()
conn.close()